arduino/ArduinoCore-zephyr/boards.txt
nano_matter.upload.tool=openocd
nano_matter.upload.tool.default=openocd
nano_matter.upload.config=-f target/efm32s2_g23.cfg
nano_matter.upload.programmer=-f interface/cmsis-dap.cfg
nano_matter.upload.maximum_data_size=262144
nano_matter.upload.maximum_size=1572864
nano_matter.upload.address=0x080C4000
nano_matter.upload.protocol=SWD
nano_matter.upload.setup_command=
nano_matter.upload.use_1200bps_touch=false
nano_matter.upload.wait_for_upload_port=false
nano_matter.upload.native_usb=false

nano_matter.bootloader.tool=openocd
nano_matter.bootloader.tool.default=openocd
nano_matter.bootloader.vid=0x2341
nano_matter.bootloader.pid=0x0072
nano_matter.bootloader.interface=0
nano_matter.bootloader.file=zephyr-{build.variant}.hex
nano_matter.bootloader.target=arduino_nano_matter

nano_matter.debug.server=openocd
nano_matter.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
nano_matter.debug.server.openocd.scripts.1=target/efm32s2_g23.cfg
nano_matter.debug.cortex-debug.custom.postAttachCommands.0=monitor reset halt
#nano_matter.debug.cortex-debug.custom.postAttachCommands.1=monitor reset_config srst_nogate
#nano_matter.debug.cortex-debug.custom.postAttachCommands.2=monitor gdb_breakpoint_override hard
nano_matter.debug.cortex-debug.custom.postAttachCommands.3=monitor gdb_sync
nano_matter.debug.cortex-debug.custom.postAttachCommands.4=c
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.0=monitor reset halt
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.1=monitor gdb_sync
nano_matter.debug.cortex-debug.custom.overrideRestartCommands.2=c
nano_matter.debug.cortex-debug.custom.request=attach

##############################################################################################################

unoq.name=Arduino UNO Q
unoq.build.core=arduino
unoq.build.crossprefix=arm-zephyr-eabi-
unoq.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

unoq.menu.link_mode.dynamic=Dynamic
unoq.menu.link_mode.static=Static
unoq.menu.link_mode.static.build.link_mode=static
unoq.menu.link_mode.static.upload.extension=bin-zsk.bin

unoq.menu.flash_mode.flash=Flash
unoq.menu.flash_mode.flash.openocd_cfg=flash_sketch.cfg
unoq.menu.flash_mode.ram=RAM
unoq.menu.flash_mode.ram.openocd_cfg=flash_sketch_ram.cfg
unoq.menu.wait_linux_boot.yes=Wait for Linux
unoq.menu.wait_linux_boot.no=Immediate
unoq.menu.wait_linux_boot.no.build.boot_mode=immediate

unoq.build.zephyr_target=arduino_uno_q
unoq.build.zephyr_args=
unoq.build.variant=arduino_uno_q_stm32u585xx
unoq.build.artifact=zephyr_unoq
unoq.build.subarch=zephyr
unoq.build.mcu=cortex-m33
unoq.build.fpu=-mfpu=fpv5-sp-d16
unoq.build.architecture=cortex-m33
unoq.compiler.zephyr.arch.define=

unoq.build.float-abi=-mfloat-abi=hard
unoq.build.extra_flags=
unoq.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
unoq.build.board=UNO_Q
unoq.build.zephyr_hals=hal_stm32
unoq.compiler.zephyr.arch.define=
unoq.compiler.zephyr=
unoq.vid.0=0x2341
unoq.pid.0=0x0078
unoq.upload_port.0.vid=0x2341
unoq.upload_port.0.pid=0x0078
unoq.upload.address=0x80F0000
unoq.upload.target=stm32u585zitxq

unoq.upload.tool=remoteocd
unoq.upload.tool.default=remoteocd
unoq.upload.tool.network=remoteocd_network
unoq.upload.protocol=
unoq.upload.transport=
unoq.upload.vid=0x2341
unoq.upload.pid=0x0078
unoq.upload.interface=0
unoq.upload.use_1200bps_touch=false
unoq.upload.wait_for_upload_port=false
unoq.upload.native_usb=true
unoq.upload.maximum_size=1966080
unoq.upload.maximum_data_size=523624

unoq.bootloader.tool=remoteocd
unoq.bootloader.tool.default=remoteocd
unoq.bootloader.file=zephyr-{build.variant}.elf
unoq.bootloader.target=stm32u585zitxq

##########################################################################################

nano_nora.name=Arduino Nano ESP32
#nano_nora.build.core=esp32
nano_nora.build.core=arduino
nano_nora.build.crossprefix=xtensa-espressif_esp32s3_zephyr-elf-
# TODO
# nano_nora.build.compiler_path={runtime.tools.xtensa-espressif_esp32s3_zephyr-elf-0.16.8.path}/bin/
nano_nora.build.compiler_path=/home/agilardoni/zephyr-sdk-0.16.8/xtensa-espressif_esp32s3_zephyr-elf/bin/

nano_nora.menu.debug.false=Standard
nano_nora.menu.debug.true=Debug
nano_nora.menu.debug.true.build.zsk_args.debug=-debug

# TODO
nano_nora.build.zephyr_target=arduino_nano_nora/esp32s3/procpu
nano_nora.build.zephyr_args=
nano_nora.build.zephyr_hals=hal_espressif
nano_nora.build.artifact=zephyr_main
nano_nora.build.variant=arduino_nano_nora_esp32s3_procpu
# TODO -mcpu is not supported by xtensa compiler
nano_nora.build.mcu=esp32s3

# TODO unrecognized command-line option
# nano_nora.build.fpu=-mfpu=fpv4-sp-d16
nano_nora.build.architecture=esp32s3

# TODO unrecognized command-line option
# nano_nora.build.float-abi=-mfloat-abi=hard
nano_nora.build.extra_flags=
nano_nora.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nano_nora.build.architecture=esp32s3
nano_nora.build.board=nano_nora


nano_nora.vid.0=0x2341
nano_nora.pid.0=0x0070
nano_nora.upload_port.0.vid=0x2341
nano_nora.upload_port.0.pid=0x0070

nano_nora.upload.tool=esptool_py
nano_nora.upload.tool.default=esptool_py
nano_nora.upload.tool.network=esp_ota

nano_nora.upload.maximum_size=1310720
nano_nora.upload.maximum_data_size=327680
nano_nora.upload.flags=
nano_nora.upload.extra_flags=
nano_nora.upload.use_1200bps_touch=false
nano_nora.upload.wait_for_upload_port=false

nano_nora.upload.protocol=
nano_nora.upload.transport=
nano_nora.upload.vid=0x2341
nano_nora.upload.pid=0x0070
nano_nora.upload.interface=0
nano_nora.upload.use_1200bps_touch=true
nano_nora.upload.wait_for_upload_port=true
nano_nora.upload.native_usb=true
nano_nora.upload.maximum_size=1966080
nano_nora.upload.maximum_data_size=523624
nano_nora.upload.address=0xD0000

nano_nora.upload.maximum_size=786432
nano_nora.upload.maximum_data_size=523624

nano_nora.bootloader.tool=esptool_py
nano_nora.bootloader.tool.default=esptool_py
nano_nora.bootloader.vid=0x2341
nano_nora.bootloader.pid=0x0070
nano_nora.bootloader.file=zephyr-{build.variant}.bin
nano_nora.bootloader.address=0x0

# nano_nora.debug.tool=gdb
# nano_nora.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
# nano_nora.debug.server.openocd.scripts.1={programmer.transport_script}
# nano_nora.debug.server.openocd.scripts.2=target/nrf52.cfg
# nano_nora.debug.cortex-debug.custom.request=attach

##########################################################################################
